app/Articulo.php

    public static function desactivar(){
        return Articulo::where('id_articulo','>',0)
        ->update(['activo'=>0]);
---
update `articulos` set `activo` = 0, `updated_at` = '2019-03-25 19:24:00' where `id_articulo` > 0

    public function inShoppingCartId(){
        return InShoppingCart::where('id_articulo',$this->id_articulo)->where('shopping_cart_id',session('shopping_cart_id'))->first()->id;
---
select * from `in_shopping_carts` where `id_articulo` = 17769 and `shopping_cart_id` = 199689 limit 1