app/Detinvart.php

delete from `detinvart` where `id` > 0
---
    public static function emptyStock(){
      return Detinvart::where('id','>',0)->delete();