app/Dolar.php

    public static function priceDolar()
    {
        $dolar= DB::table('dolares')->orderBy('id_dolar','desc')
                                                ->take(1)->get();
---
select * from `dolares` order by `id_dolar` desc limit 1