app/ShoppingCart.php

select * from `shopping_carts` where `shopping_carts`.`id` = 164150 limit 1
---
    public static function findBySession($shopping_cart_id)
    {
      return ShoppingCart::find($shopping_cart_id);