app/Soap.php

select * from `marcas` where (`marca` = 'LOGITECH') limit 1
select * from `lineas` where (`linea` = 'MOUSE') limit 1
select * from `series` where (`name` = 'GAMER') limit 1
select * from `articulos` where (`sku` = 'AC-22140104-03') limit 1
---
     public function updateDB($items)
    {
        ini_set('max_execution_time', -1);
        $dolar=Dolar::priceDolar();
        $i=0;
        $items = collect($items);
        foreach($items->chunk(300) as $chunk)
        {
          foreach ($chunk as $item) {
            // code...
            if($item->moneda=='USD'){
                $item->moneda='MN';
                $item->precio=$item->precio*$dolar;
            }
            $brand=Brand::firstOrCreate(['marca'=>$item->marca]);
            $line=Line::firstOrCreate(['linea'=>$item->linea]);
            $serie=Serie::firstOrCreate(['name'=>$item->serie]);
            $section=Section::firstOrCreate(['seccion'=>$item->seccion]);
            $product = Articulo::firstOrNew(['sku'=>$item->sku]);

select * from `marcas` where (`marca` = 'LOGITECH') limit 1
select * from `lineas` where (`linea` = 'MOUSE') limit 1
select * from `series` where (`name` = 'GAMER') limit 1
select * from `articulos` where (`sku` = 'AC-22140104-03') limit 1
select * from `detinvart` where (`id_inventario` = 19 and `id_articulo` = 14285) limit 1
---
    public static function updating($items)
    {
      ini_set('max_execution_time', -1);
      $dolar=Dolar::priceDolar();
      foreach ($items as $item) {
        // code...
        if($item->moneda=='USD'){
            $item->moneda='MN';
            $item->precio=$item->precio*$dolar;
        }
        $brand=Brand::firstOrCreate(['marca'=>$item->marca]);
        $line=Line::firstOrCreate(['linea'=>$item->linea]);
        $serie=Serie::firstOrCreate(['name'=>$item->serie]);
        $section=Section::firstOrCreate(['seccion'=>$item->seccion]);
        $product = Articulo::updateOrCreate(['sku'=>$item->sku],
        ['proveedor'=>'pchmayoreo','sku'=>$item->sku,'descripcion'=>$item->descripcion,
        'id_serie'=>$serie->id,'skuFabricante'=>$item->skuFabricante,'id_marca'=>$brand->id_marca,
        'id_seccion'=>$section->id_seccion,'id_linea' => $line->id_linea,'moneda' => $item->moneda,
        'activo' => 1,'precio'=>$item->precio]);
        $data = array();
        $data['categoria']=$item->seccion;
        $data['precio']=$item->precio;
        $data['product'] = $product;
        $utilidad=Soap::addUtilidad($data);
        foreach($item->inventario as $data){
          $inventario=Inventory::firstOrCreate(['almacen'=>$data->almacen]);
          $det = Detinvart::updateOrCreate(['id_inventario'=>$inventario->id_inventario,'id_articulo'=>$product->id_articulo],
          ['existencia'=>$data->existencia]);