app/Http/Controllers/ArticlesController.php

update `articulos` set `updated_at` = '2019-06-17 18:18:09', `extension` = 'jpeg' where `id_articulo` = 17356
---
    public function update(Request $request, $id)
    {

        $article = Articulo::find($id);
        $messages=['image'=>'El :attribute tiene que ser una imagen',
                    'dimensions'=>'Las dimensiones de :attribute tienen que ser de 3200 x 800 width-height','required'=>'El :attribute es un campo requerido'];
        $validator=Validator::make(['image'=>$request->file('image')],[
            'image'=>['image','required','dimensions:width>200,height>200'],
            ],$messages);
        if(!$validator->fails()){
            if($request->hasFile('image'))
                if($request->file('image')->isValid()){

                    $img = \Storage::disk('public')->putFileAs('images/imgsPCH',$request->file('image'),$article->sku.'.'.$request->image->extension());

                    //\Storage::setVisibility('sliders/'.$request->file('slider'),'public');
                    $article->extension = $request->image->extension();
                    $article->save();