app/Http/Controllers/HomeController.php

select * from `sliders` order by `id` desc limit 3
select * from `articulos` where `id_utilidad` != 0 order by `visits` desc limit 12
select * from `utilidades` where `utilidades`.`id_utilidad` in (12, 14, 19, 50, 93)
---
   public function index(Request $request)
    {
        if($request->wantsJson()){
          $data = array();
          foreach(Click::mostVisited() as $click){
            array_push($data,new Product($click->articulo));
          }
          return $data;
        }
        $sliders=Slider::orderBy('id','desc')->limit(3)->get()->take(3);
        $articles = Articulo::with('utilidade')->where('id_utilidad','!=',0)->orderBy('visits','desc')->limit(12)->get();