app/Http/Controllers/InShoppingCartsController.php

select * from `in_shopping_carts` where `id_articulo` = '17769' and `shopping_cart_id` = 199830 limit 1
update `in_shopping_carts` set `qty` = 3 where `id` = 625
---
    public function store(Request $request)
    {
        if(!$request->qty < $request->existencia)
        {
            $in_shopping_cart = InShoppingCart::where('id_articulo',$request->id_articulo)
                ->where('shopping_cart_id',$request->shopping_cart->id)->first();
            if($in_shopping_cart)
                {
                  $in_shopping_cart->qty += $request->qty;
                  $in_shopping_cart->save();

select SUM(qty) as cantidad from `in_shopping_carts` where `in_shopping_carts`.`shopping_cart_id` = 199830 and `in_shopping_carts`.`shopping_cart_id` is not null
select * from `in_shopping_carts` where `id` in ('626')
---
    public function update(Request $request, $id)
    {
        $inShoppingCart=InShoppingCart::find($id);
        // obtener existencia de dicho articulo .. en detinvart
        if($request->name=='qty')
        {
            $id_articulo=$inShoppingCart->id_articulo;
            $articulo=Articulo::find($id_articulo);
            //dd([$id_articulo,$inShoppingCart->almacen]);
            $existencia=$articulo->detinvart($id_articulo,$inShoppingCart->almacen)->existencia;
            if($request->value > $existencia)
            {
                return response()->json([
                    'success'=>false,
                    'status'=>'500']);
            }
            else
            {
                $field=$request->name;
                $inShoppingCart->$field=$request->value;
                $inShoppingCart->save();
                return response()->json([
                    'success'=>true]);
            }
        }
       /* $field=$request->name;
        $inShoppingCart->$field=$request->value;

delete from `in_shopping_carts` where `id` = 626
---
    public function destroy($id)
    {
        $ban=inShoppingCart::destroy($id);