app/Providers/AppServiceProvider.php

select * from `secciones` where `status` = 1 order by `seccion` asc
select * from `marcas` where `status` = 1 order by `marca` asc
select * from `lineas` order by `linea` asc
select * from `series` order by `name` asc
---
                return true;
            return false;
        });
        view()->composer('*',function($view){
            $secciones=Section::orderBy('seccion','asc')->where('status','=',1)->get();
            $marcas=Brand::orderBy('marca','asc')->where('status','=',1)->get();
            //$vars['productsCount']=
            $vars['secciones']=$secciones;
            \Session::put('item-products',$secciones);
            \Session::put('brand-products',$marcas);
            $vars['marcas']=$marcas;
            $vars['lineas']=Line::orderBy('linea','asc')->get();
            $vars['lines']=$vars['lineas']->take(10);
            //$vars['lines']=Line::limit(10);
            $vars['series']=Serie::orderBy('name','asc')->get();
            $vars['products']=$secciones->take(10);
            $view->with('vars',$vars);
              /*$shopping_cart_id=\Session::get('shopping_cart_id');
              $shopping_cart=ShoppingCart::findBySessionShoppingCart($shopping_cart_id);
              \Session::put('shopping_cart_id',$shopping_cart_id);*/
      });