app/Http/Controllers/admin/ProductsController.php

    public function index(Request $request)
    {

        if($request->wantsJson())
          return response()->json(new ProductsCollection( Articulo::where('activo',1)->orderBy('id_articulo','desc')->paginate(25)));
---
select * from `articulos` where `activo` = 1 order by `id_articulo` desc limit 25 offset 0
select count(*) as aggregate from `articulos` where `activo` = 1